cmsis-svd/cmsis-svd/data/Atmel/ATSAME70J21B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MATRIX</name>
         <version>11282L</version>
         <description>AHB Bus Matrix</description>
         <groupName>MATRIX</groupName>
         <prependToName>MATRIX_</prependToName>
         <baseAddress>0x40088000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1EC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>13</dim>
               <dimIncrement>4</dimIncrement>
               <name>MATRIX_MCFG[%s]</name>
               <description>Master Configuration Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ULBT</name>
                     <description>Undefined Length Burst Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ULBTSelect</name>
                        <enumeratedValue>
                           <name>UNLTD_LENGTH</name>
                           <description>Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE_ACCESS</name>
                           <description>Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4BEAT_BURST</name>
                           <description>4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8BEAT_BURST</name>
                           <description>8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BEAT_BURST</name>
                           <description>16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BEAT_BURST</name>
                           <description>32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BEAT_BURST</name>
                           <description>64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128BEAT_BURST</name>
                           <description>128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>9</dim>
               <dimIncrement>4</dimIncrement>
               <name>MATRIX_SCFG[%s]</name>
               <description>Slave Configuration Register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Bus Grant Duration for Masters</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>9</dim>
               <dimIncrement>8</dimIncrement>
               <name>MATRIX_PR[%s]</name>
               <description>Priority Register A for Slave 0</description>
               <addressOffset>0x0080</addressOffset>
               <register>
                  <name>MATRIX_PRAS</name>
                  <description>Priority Register A for Slave 0</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>M0PR</name>
                        <description>Master 0 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M1PR</name>
                        <description>Master 1 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M2PR</name>
                        <description>Master 2 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M3PR</name>
                        <description>Master 3 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M4PR</name>
                        <description>Master 4 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M5PR</name>
                        <description>Master 5 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M6PR</name>
                        <description>Master 6 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MATRIX_PRBS</name>
                  <description>Priority Register B for Slave 0</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>M8PR</name>
                        <description>Master 8 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M9PR</name>
                        <description>Master 9 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M10PR</name>
                        <description>Master 10 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M11PR</name>
                        <description>Master 11 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>M12PR</name>
                        <description>Master 12 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>MATRIX_MRCR</name>
               <description>Master Remap Control Register</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB6</name>
                     <description>Remap Command Bit for Master 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB8</name>
                     <description>Remap Command Bit for Master 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB9</name>
                     <description>Remap Command Bit for Master 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB10</name>
                     <description>Remap Command Bit for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB11</name>
                     <description>Remap Command Bit for Master 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB12</name>
                     <description>Remap Command Bit for Master 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_CAN0</name>
               <description>CAN0 Configuration Register</description>
               <addressOffset>0x0110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CAN0DMABA</name>
                     <description>CAN0 DMA Base Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_SYSIO</name>
               <description>System I/O Configuration Register</description>
               <addressOffset>0x0114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SYSIO4</name>
                     <description>PB4 or TDI Assignment</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO5</name>
                     <description>PB5 or TDO/TRACESWO Assignment</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO6</name>
                     <description>PB6 or TMS/SWDIO Assignment</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO7</name>
                     <description>PB7 or TCK/SWCLK Assignment</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO12</name>
                     <description>PB12 or ERASE Assignment</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_PCCR</name>
               <description>Peripheral Clock Configuration Register</description>
               <addressOffset>0x0118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TC0CC</name>
                     <description>TC0 Clock Configuration</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2SC0CC</name>
                     <description>I2SC0 Clock Configuration</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2SC1CC</name>
                     <description>I2SC1 Clock Configuration</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_DYNCKG</name>
               <description>Dynamic Clock Gating Register</description>
               <addressOffset>0x011C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MATCKG</name>
                     <description>MATRIX Dynamic Clock Gating</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BRIDCKG</name>
                     <description>Bridge Dynamic Clock Gating Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFCCKG</name>
                     <description>EFC Dynamic Clock Gating Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_SMCNFCS</name>
               <description>SMC NAND Flash Chip Select Configuration Register</description>
               <addressOffset>0x0124</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMC_NFCS0</name>
                     <description>SMC NAND Flash Chip Select 0 Assignment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMC_NFCS1</name>
                     <description>SMC NAND Flash Chip Select 1 Assignment</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMC_NFCS2</name>
                     <description>SMC NAND Flash Chip Select 2 Assignment</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMC_NFCS3</name>
                     <description>SMC NAND Flash Chip Select 3 Assignment</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDRAMEN</name>
                     <description>SDRAM Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x01E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x4D4154</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x01E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
